In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['kartik' , 'rohan' , 'raman' ],
    "age" : [18 , 20 , 21 ],
    "city" : ['delhi' , 'bombay' , 'pune'],
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  age    city
0  kartik   18   delhi
1   rohan   20  bombay
2   raman   21    pune

In [5]:
df.to_csv('kartik.csv')

In [8]:
df.to_csv('kartik_index_false.csv' , index=False)

In [9]:
df.head(2)

     name  age    city
0  kartik   18   delhi
1   rohan   20  bombay

In [10]:
df.tail(1)

    name  age  city
2  raman   21  pune

In [11]:
df.describe()

             age
count   3.000000
mean   19.666667
std     1.527525
min    18.000000
25%    19.000000
50%    20.000000
75%    20.500000
max    21.000000